; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v10)
             (pred_3 ?v1 ?v12)
             (pred_4 ?v5 ?v12)
             (pred_5 ?v7 ?v5 )
	     (pred_8 ?v5)
             (pred_9 ?v8)
             (pred_10 ?v1)
             (pred_1 ?v12)
             (pred_7 ?v5)
             (pred_12 ?v1)
             (pred_6 ?v5)
             (pred_2 ))



(:action op_3
:parameters (?v9 ?v11 ?v2 ?v6)
:precondition (and (pred_9 ?v9) (pred_9 ?v11) (pred_10 ?v2) (pred_1 ?v6)
          (pred_11 ?v9 ?v11) (pred_3 ?v2 ?v6)
                   (pred_4 ?v11 ?v6) (pred_8 ?v9) 
                   (pred_7 ?v11) (pred_12 ?v2))
:effect (and  (pred_6 ?v11) (not (pred_7 ?v11))))


(:action op_2
:parameters (?v9 ?v3)
:precondition (and (pred_9 ?v9) (pred_9 ?v3)
               (pred_8 ?v9) (pred_11 ?v9 ?v3) (pred_6 ?v3))
:effect (and (pred_8 ?v3) (not (pred_8 ?v9))))

(:action op_1
:parameters (?v9 ?v2)
:precondition (and (pred_9 ?v9) (pred_10 ?v2) 
                  (pred_8 ?v9) (pred_5 ?v2 ?v9) (pred_2 ))
:effect (and (pred_12 ?v2)
   (not (pred_5 ?v2 ?v9)) (not (pred_2 ))))


(:action op_4
:parameters (?v9 ?v13 ?v4)
:precondition (and (pred_9 ?v9) (pred_10 ?v13) (pred_10 ?v4)
                  (pred_8 ?v9) (pred_12 ?v4) (pred_5 ?v13 ?v9))
:effect (and (pred_12 ?v13) (pred_5 ?v4 ?v9)
        (not (pred_12 ?v4)) (not (pred_5 ?v13 ?v9))))

(:action op_5
:parameters (?v9 ?v2)
:precondition (and (pred_9 ?v9) (pred_10 ?v2) 
                  (pred_8 ?v9) (pred_12 ?v2))
:effect (and (pred_2 ) (pred_5 ?v2 ?v9) (not (pred_12 ?v2)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_02 obj_18 obj_01 obj_29 obj_28 obj_17 obj_12 obj_13 obj_21 obj_05 obj_20 obj_27 obj_11 obj_24 obj_10 obj_16 obj_14 obj_26 obj_25 obj_30 obj_08 obj_15 obj_04 obj_23
    obj_06 obj_22
    obj_09 obj_19 obj_07
    )

    (:init
       (pred_2)

       (pred_9 obj_03)
       (pred_9 obj_02)
       (pred_9 obj_18)
       (pred_9 obj_01)
       (pred_9 obj_29)
       (pred_9 obj_28)
       (pred_9 obj_17)
       (pred_9 obj_12)
       (pred_9 obj_13)
       (pred_9 obj_21)
       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_27)
       (pred_9 obj_11)
       (pred_9 obj_24)
       (pred_9 obj_10)
       (pred_9 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_26)
       (pred_9 obj_25)
       (pred_9 obj_30)
       (pred_9 obj_08)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_23)
       (pred_1 obj_06)
       (pred_1 obj_22)
       (pred_10 obj_09)
       (pred_10 obj_19)
       (pred_10 obj_07)

       (pred_11 obj_03 obj_28)
       (pred_11 obj_03 obj_02)
       (pred_11 obj_02 obj_17)
       (pred_11 obj_02 obj_18)
       (pred_11 obj_02 obj_03)
       (pred_11 obj_18 obj_12)
       (pred_11 obj_18 obj_01)
       (pred_11 obj_18 obj_02)
       (pred_11 obj_01 obj_13)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_01 obj_18)
       (pred_11 obj_29 obj_21)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_28 obj_05)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_28 obj_03)
       (pred_11 obj_17 obj_20)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_12 obj_27)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_18)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_13 obj_11)
       (pred_11 obj_13 obj_21)
       (pred_11 obj_13 obj_01)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_21 obj_24)
       (pred_11 obj_21 obj_29)
       (pred_11 obj_21 obj_13)
       (pred_11 obj_05 obj_10)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_05 obj_28)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_20 obj_17)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_27 obj_14)
       (pred_11 obj_27 obj_11)
       (pred_11 obj_27 obj_12)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_11 obj_26)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_11 obj_13)
       (pred_11 obj_11 obj_27)
       (pred_11 obj_24 obj_25)
       (pred_11 obj_24 obj_21)
       (pred_11 obj_24 obj_11)
       (pred_11 obj_10 obj_30)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_10 obj_05)
       (pred_11 obj_16 obj_08)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_14 obj_26)
       (pred_11 obj_14 obj_27)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_26 obj_04)
       (pred_11 obj_26 obj_25)
       (pred_11 obj_26 obj_11)
       (pred_11 obj_26 obj_14)
       (pred_11 obj_25 obj_23)
       (pred_11 obj_25 obj_24)
       (pred_11 obj_25 obj_26)
       (pred_11 obj_30 obj_08)
       (pred_11 obj_30 obj_10)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_08 obj_16)
       (pred_11 obj_08 obj_30)
       (pred_11 obj_15 obj_04)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_04 obj_23)
       (pred_11 obj_04 obj_26)
       (pred_11 obj_04 obj_15)
       (pred_11 obj_23 obj_25)
       (pred_11 obj_23 obj_04)
       (pred_7 obj_29)
       (pred_7 obj_16)
       (pred_7 obj_11)
       (pred_4  obj_29 obj_06)
       (pred_4  obj_16 obj_22)
       (pred_4  obj_11 obj_06)
       (pred_6 obj_03)
       (pred_6 obj_02)
       (pred_6 obj_18)
       (pred_6 obj_01)
       (pred_6 obj_28)
       (pred_6 obj_17)
       (pred_6 obj_12)
       (pred_6 obj_13)
       (pred_6 obj_21)
       (pred_6 obj_05)
       (pred_6 obj_20)
       (pred_6 obj_27)
       (pred_6 obj_24)
       (pred_6 obj_10)
       (pred_6 obj_14)
       (pred_6 obj_26)
       (pred_6 obj_25)
       (pred_6 obj_30)
       (pred_6 obj_08)
       (pred_6 obj_15)
       (pred_6 obj_04)
       (pred_6 obj_23)

       (pred_3  obj_09 obj_06)
       (pred_3  obj_19 obj_22)
       (pred_3  obj_07 obj_22)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_07 obj_14)
       (pred_8 obj_12)
    )

    (:goal (and
       (pred_5 obj_09 obj_10)
    ))
(:constraints
  (always (not (pred_8 obj_27)))
)
)

; plan
1. (op_2 obj_12 obj_17)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_17)
   goals met: 0 of 1
2. (op_2 obj_17 obj_20)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_20)
   goals met: 0 of 1
3. (op_2 obj_20 obj_05)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_05)
   goals met: 0 of 1
4. (op_2 obj_05 obj_10)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_10)
   goals met: 0 of 1
5. (op_2 obj_10 obj_30)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_30)
   goals met: 0 of 1
6. (op_2 obj_30 obj_08)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_08)
   goals met: 0 of 1
7. (op_2 obj_08 obj_15)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_15)
   goals met: 0 of 1
8. (op_2 obj_15 obj_14)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_14)
   goals met: 0 of 1
9. (op_1 obj_14 obj_09)
   deleted: (pred_5 obj_09 obj_14) (pred_2)
   added: (pred_12 obj_09)
   goals met: 0 of 1
10. (op_2 obj_14 obj_15)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_15)
   goals met: 0 of 1
11. (op_2 obj_15 obj_08)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_08)
   goals met: 0 of 1
12. (op_2 obj_08 obj_30)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_30)
   goals met: 0 of 1
13. (op_2 obj_30 obj_10)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_10)
   goals met: 0 of 1
14. (op_5 obj_10 obj_09)
   deleted: (pred_12 obj_09)
   added: (pred_2) (pred_5 obj_09 obj_10)
   goals met: 1 of 1
